In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('data/agora.csv');df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [3]:
df.isnull().sum()

Marketing Spend    0
Administration     0
Transport          1
Area               0
Profit             0
dtype: int64

In [4]:
df.describe()

       Marketing Spend  Administration      Transport         Profit
count        50.000000       50.000000      49.000000      50.000000
mean      73721.615600   121344.639600  215331.732449  112012.639200
std       45902.256482    28017.802755  119665.391550   40306.180338
min           0.000000    51283.140000       0.000000   14681.400000
25%       39936.370000   103730.875000  134050.070000   90138.902500
50%       73051.080000   122699.795000  214634.810000  107978.190000
75%      101602.800000   144842.180000  299737.290000  139765.977500
max      165349.200000   182645.560000  471784.100000  192261.830000

In [5]:
df.Transport = df.Transport.fillna(df.Transport.mean())

In [6]:
df.Transport.isna().sum()

0

# Replace Function

In [7]:
df1 = pd.read_csv('data/insurance.csv');df1.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [8]:
df2 = df1.copy()
df3 = df1.copy()
df4 = df1.copy()

# Replace Function

In [10]:
colums = ['sex','smoker','region']

In [11]:
for col in colums:
    uniq = df1[col].unique()
    value = [numb for numb in range(len(uniq))]
    df1[col] = df1[col].replace(uniq,value)

In [12]:
df1.head()

   age  sex     bmi  children  smoker  region      charges
0   19    0  27.900         0       0       0  16884.92400
1   18    1  33.770         1       1       1   1725.55230
2   28    1  33.000         3       1       1   4449.46200
3   33    1  22.705         0       1       2  21984.47061
4   32    1  28.880         0       1       2   3866.85520

# Label Encoder

In [13]:
from sklearn.preprocessing import LabelEncoder

In [14]:
from pandas.core.dtypes.common import is_numeric_dtype

In [15]:
for col in df2.columns:
    if is_numeric_dtype(df2[col]):
        continue
    df2[col] = LabelEncoder().fit_transform(df2[col])

In [16]:
df2.head()

   age  sex     bmi  children  smoker  region      charges
0   19    0  27.900         0       1       3  16884.92400
1   18    1  33.770         1       0       2   1725.55230
2   28    1  33.000         3       0       2   4449.46200
3   33    1  22.705         0       0       1  21984.47061
4   32    1  28.880         0       0       1   3866.85520

# One Hot Encoding

In [17]:
cols = ['sex','smoker','region']
for col in cols:
    col_ohe = pd.get_dummies(df3[col], prefix=col)
    df3 = pd.concat((df3, col_ohe), axis=1).drop(col, axis=1)

In [18]:
df3.head()

,age,bmi,children,charges,sex_female,sex_male,smoker_no,smoker_yes,region_northeast,region_northwest,region_southeast,region_southwest
0,19,27.900,0,16884.92400,1,0,0,1,0,0,0,1
1,18,33.770,1,1725.55230,0,1,1,0,0,0,1,0
2,28,33.000,3,4449.46200,0,1,1,0,0,0,1,0
3,33,22.705,0,21984.47061,0,1,1,0,0,1,0,0
4,32,28.880,0,3866.85520,0,1,1,0,0,1,0,0

# Ordinal Encoding

In [19]:
from sklearn.preprocessing import OrdinalEncoder

In [20]:
for col in cols:
    uniq = df4[col].unique()
    df4[col] = OrdinalEncoder(categories=[uniq]).fit_transform(df4[[col]])

In [21]:
df4.head()

   age  sex     bmi  children  smoker  region      charges
0   19  0.0  27.900         0     0.0     0.0  16884.92400
1   18  1.0  33.770         1     1.0     1.0   1725.55230
2   28  1.0  33.000         3     1.0     1.0   4449.46200
3   33  1.0  22.705         0     1.0     2.0  21984.47061
4   32  1.0  28.880         0     1.0     2.0   3866.85520